# Brewfile - Package manager configuration for macOS
# Run with: brew bundle

# Command line tools and utilities
brew "git"
brew "wget"
brew "lazygit"
brew "python3"
brew "uv"
brew "autoconf"
brew "automake"
brew "libtool"
brew "gettext"
brew "llvm"
brew "autojump"
brew "thefuck"
brew "direnv"
brew "dockutil"
brew "jq"
brew "coreutils"
brew "defaultbrowser"

# Node.js ecosystem
brew "node"
brew "pnpm"
brew "yarn"

# Rust development - handled by components/rust.sh

# JavaScript/TypeScript tools
brew "biome"

# GUI Applications (Casks)
cask "iterm2"
cask "cursor"
cask "1password"
cask "betterdisplay"
cask "discord"
cask "figma"
cask "postman"
cask "airbuddy"
cask "google-chrome"
cask "insta360-link-controller"
cask "docker"
cask "arc"